In [2]:
# Importing libraries
import pandas as pd
import numpy as np

In [4]:
# Creating sample dataframe
data = pd.DataFrame ({"Name": ['Tifa', 'Cloud', 'Sterling'],
                      "Species" : ['Dog', 'Dog', 'Cat'],
                      "Age" : [10, 11, 1]})
data

       Name Species  Age
0      Tifa     Dog   10
1     Cloud     Dog   11
2  Sterling     Cat    1

In [6]:
# Using lambda function to create new column of ages in human years (i.e. multiplied by 7)
data['Human_Age'] = data['Age'].apply(lambda x: x*7)
data

       Name Species  Age  Human_Age
0      Tifa     Dog   10         70
1     Cloud     Dog   11         77
2  Sterling     Cat    1          7

In [9]:
# Creating a label column based on Human_Age column following typical human age classifications (Senior, Adult, Young)
data['Age_Label'] = data['Human_Age'].apply(
    lambda x: 'Senior' if x > 65 else ('Adult' if x >= 18 else 'Young'))
data

       Name Species  Age  Human_Age Age_Label
0      Tifa     Dog   10         70    Senior
1     Cloud     Dog   11         77    Senior
2  Sterling     Cat    1          7     Young